In [ ]:
from google.colab import drive
drive.mount("/content/gdrive")

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
candidates = pd.read_csv("/content/gdrive/MyDrive/candidates.txt", sep='|', usecols=[0,1,2,3,4,5,9], names=['CAND_ID', 'CAND_NAME', 'CAND_PTY_AFFILIATION', 'CAND_ELECTION_YR', 'CAND_OFFICE_ST', 'CAND_OFFICE','CAND_PCC'])
candidates = candidates[candidates["CAND_ELECTION_YR"]==2020]
del candidates['CAND_ELECTION_YR']
print(candidates.shape)
candidates.head()

(5050, 6)

     CAND_ID                     CAND_NAME  ... CAND_OFFICE   CAND_PCC
0  H0AK00105                  LAMB, THOMAS  ...           H  C00607515
1  H0AK00113             TUGATUK, RAY SEAN  ...           H        NaN
2  H0AK01046              CATALANO, THOMAS  ...           H        NaN
3  H0AL01055           CARL, JERRY LEE, JR  ...           H  C00697789
4  H0AL01063  LAMBERT, DOUGLAS WESTLEY III  ...           H  C00701557

[5 rows x 6 columns]

In [ ]:
committees = pd.read_csv("/content/gdrive/My Drive/committees.txt", sep='|', usecols = [0,1,6,8,9,10,12,14], names=['CMTE_ID', 'CMTE_NM', 'CMTE_ST', 'CMTE_DSGN', 'CMTE_TP', 'CMTE_PTY_AFFILIATION', 'ORG_TP', 'CAND_ID'])
print(committees.shape)
committees.head()

(17605, 8)

       CMTE_ID  ... CAND_ID
0  \tC00000059  ...     NaN
1    C00000422  ...     NaN
2    C00000489  ...     NaN
3    C00000547  ...     NaN
4    C00000638  ...     NaN

[5 rows x 8 columns]

In [ ]:
candidate_committee_linkages = pd.read_csv("/content/gdrive/My Drive/candidate_committee_linkages.txt", sep='|', usecols = [0,3], names=['CAND_ID',  'CAND_ELECTION_YR', 'FEC_ELECTION_YR',  'CMTE_ID',  'CMTE_TP',  'CMTE_DSGN',  'LINKAGE_ID'])
print(candidate_committee_linkages.shape)
print(len(candidate_committee_linkages.CAND_ID.unique()))
candidate_committee_linkages.head()

(6825, 2)
6138

     CAND_ID    CMTE_ID
0  C00713602  C00712851
1  H0AK00105  C00607515
2  H0AL01055  C00697789
3  H0AL01063  C00701557
4  H0AL01071  C00701409

In [ ]:
individual_contributions = pd.read_csv("/content/gdrive/My Drive/indiv.txt", sep='|', usecols = [0,5,6,13,14], names=['CMTE_ID','TRANSACTION_TP', 'ENTITY_TP', 'TRANSACTION_DT', 'TRANSACTION_AMT'])
print(individual_contributions.shape)
individual_contributions.head()

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (13,14) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

(36302237, 5)

     CMTE_ID TRANSACTION_TP ENTITY_TP TRANSACTION_DT TRANSACTION_AMT
0  C00432906            22Y       IND        1182019            -500
1  C00432906            22Y       IND        1182019             500
2  C00640870            15C       CAN        1242019              76
3  C00638478             15       IND        1252019             -50
4  C00638478            15C       CAN        1282019           59816

In [ ]:
committees_to_candidates_contributions = pd.read_csv("/content/gdrive/My Drive/committees_to_candidates_contributions.txt", sep='|', usecols = [0,5,6,7,9,13,14,16], names=['CMTE_ID','TRANSACTION_TP','ENTITY_TP','NAME','STATE','TRANSACTION_DT','TRANSACTION_AMT','CAND_ID'])
print(committees_to_candidates_contributions.shape)
committees_to_candidates_contributions.head()

(260811, 8)

     CMTE_ID TRANSACTION_TP  ... TRANSACTION_AMT    CAND_ID
0  C00567180            24K  ...            1880  H2FL06109
1  C00104885            24K  ...            3000  H4SC03087
2  C00104885            24K  ...            1000  H0SC01279
3  C00104885            24K  ...             470  H2SC02042
4  C00688408            24E  ...            1000  S8MS00287

[5 rows x 8 columns]

In [ ]:
committee_to_committee_contributions = pd.read_csv("/content/gdrive/My Drive/committee_to_committee.txt", sep='|', usecols = [0,5,6,13,14,15], names=['CMTE_ID','TRANSACTION_TP','ENTITY_TP','TRANSACTION_DT','TRANSACTION_AMT','OTHER_ID'])
print(committee_to_committee_contributions.shape)
committee_to_committee_contributions.head()

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (15) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

(1837255, 6)

     CMTE_ID TRANSACTION_TP  ... TRANSACTION_AMT   OTHER_ID
0  C00567180            24K  ...            1880  C00494583
1  C00650440            24K  ...             700  C00640086
2  C00638478            20C  ...            2795  H8CA39133
3  C00638478            20C  ...           59816  H8CA39133
4  C00638478            20C  ...           50000  H8CA39133

[5 rows x 6 columns]

In [ ]:
expenses = pd.read_csv("/content/gdrive/My Drive/op_expenses.txt", sep='|', usecols = [0,2,12,13,15,16,17], names=['CMTE_ID','REPORT_YR','TRANSACTION_DT','TRANSACTION_AMT','PURPOSE','CATEGORY','CATEGORY_DESC'])
print(expenses.shape)
expenses = expenses[expenses["REPORT_YR"]==2020]
del expenses['REPORT_YR']
expenses.head()

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (16,17) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

(1719829, 7)

          CMTE_ID TRANSACTION_DT  ...  CATEGORY          CATEGORY_DESC
389573  C00675041     01/10/2020  ...       NaN                    NaN
389574  C00482307     01/16/2020  ...       NaN                    NaN
389575  C00726935     12/04/2019  ...       NaN                    NaN
389576  C00726935     12/19/2019  ...       NaN                    NaN
389577  C00726935     12/31/2019  ...         4  Advertising Expenses

[5 rows x 6 columns]

In [ ]:
candidates.head()#checking data/ taking a look of the whole dataset

     CAND_ID                     CAND_NAME  ... CAND_OFFICE   CAND_PCC
0  H0AK00105                  LAMB, THOMAS  ...           H  C00607515
1  H0AK00113             TUGATUK, RAY SEAN  ...           H        NaN
2  H0AK01046              CATALANO, THOMAS  ...           H        NaN
3  H0AL01055           CARL, JERRY LEE, JR  ...           H  C00697789
4  H0AL01063  LAMBERT, DOUGLAS WESTLEY III  ...           H  C00701557

[5 rows x 6 columns]

In [ ]:
candidate_committee_linkages.head(3)#checking data

     CAND_ID    CMTE_ID
0  C00713602  C00712851
1  H0AK00105  C00607515
2  H0AL01055  C00697789

In [ ]:
df1=candidate_committee_linkages.iloc[:,[0,1]]#extracting columns that are useful and ignoring the others
df1.head()

     CAND_ID    CMTE_ID
0  C00713602  C00712851
1  H0AK00105  C00607515
2  H0AL01055  C00697789
3  H0AL01063  C00701557
4  H0AL01071  C00701409

In [ ]:
individual_contributions.head(3)#checking data

     CMTE_ID TRANSACTION_TP ENTITY_TP TRANSACTION_DT TRANSACTION_AMT
0  C00432906            22Y       IND        1182019            -500
1  C00432906            22Y       IND        1182019             500
2  C00640870            15C       CAN        1242019              76

In [ ]:
df2=individual_contributions.iloc[:,[0,4]]#extracting columns of committee id and the transaction amount
df2.columns=["CMTE_ID","TRANSACTION_AMT_1"]
df2.head()

     CMTE_ID TRANSACTION_AMT_1
0  C00432906              -500
1  C00432906               500
2  C00640870                76
3  C00638478               -50
4  C00638478             59816

In [ ]:
committees_to_candidates_contributions.head(3)

     CMTE_ID TRANSACTION_TP  ... TRANSACTION_AMT    CAND_ID
0  C00567180            24K  ...            1880  H2FL06109
1  C00104885            24K  ...            3000  H4SC03087
2  C00104885            24K  ...            1000  H0SC01279

[3 rows x 8 columns]

In [ ]:
df3=committees_to_candidates_contributions.iloc[:,[0,6,7]]#extracting useful colums
df3.columns=["CMTE","TRANSACTION_AMT_2","CAND_ID"]
df3.head()

        CMTE  TRANSACTION_AMT_2    CAND_ID
0  C00567180               1880  H2FL06109
1  C00104885               3000  H4SC03087
2  C00104885               1000  H0SC01279
3  C00104885                470  H2SC02042
4  C00688408               1000  S8MS00287

In [ ]:
committee_to_committee_contributions.head(3)

     CMTE_ID TRANSACTION_TP  ... TRANSACTION_AMT   OTHER_ID
0  C00567180            24K  ...            1880  C00494583
1  C00650440            24K  ...             700  C00640086
2  C00638478            20C  ...            2795  H8CA39133

[3 rows x 6 columns]

In [ ]:
df4=committee_to_committee_contributions.iloc[:,[0,4,5]]#extracting useful colums
df4.columns=["CMTE_ID","TRANSACTION_AMT_3","OTHER_ID"]
df4.head()

     CMTE_ID  TRANSACTION_AMT_3   OTHER_ID
0  C00567180               1880  C00494583
1  C00650440                700  C00640086
2  C00638478               2795  H8CA39133
3  C00638478              59816  H8CA39133
4  C00638478              50000  H8CA39133

In [ ]:
expenses.head(3)

          CMTE_ID TRANSACTION_DT  ...  CATEGORY CATEGORY_DESC
389573  C00675041     01/10/2020  ...       NaN           NaN
389574  C00482307     01/16/2020  ...       NaN           NaN
389575  C00726935     12/04/2019  ...       NaN           NaN

[3 rows x 6 columns]

In [ ]:
df5=expenses.iloc[:,[0,2]]#extracting useful colums
df5.columns=["CMTE_ID","TRANSACTION_AMT_4"]
df5.head()

          CMTE_ID  TRANSACTION_AMT_4
389573  C00675041             150.00
389574  C00482307             689.35
389575  C00726935            1405.83
389576  C00726935            2563.00
389577  C00726935             725.00

In [ ]:
print(df1.columns.values," \t\t\t   com-cond-linakges")
print(df2.columns.values,"  \t   individual")
print(df3.columns.values,"    com-to-cand")
print(df4.columns.values,"com-to-com")
print(df5.columns.values,"\t   expenses")

['CAND_ID' 'CMTE_ID']  			   com-cond-linakges
['CMTE_ID' 'TRANSACTION_AMT_1']   	   individual
['CMTE' 'TRANSACTION_AMT_2' 'CAND_ID']     com-to-cand
['CMTE_ID' 'TRANSACTION_AMT_3' 'OTHER_ID'] com-to-com
['CMTE_ID' 'TRANSACTION_AMT_4'] 	   expenses

In [ ]:
#df6=df2.append(df4)#merging the datasets on the column CMTE_ID
#df7=df5.append(df6)

In [ ]:
inflow_1=pd.concat([df5,df2,df4,df1])
inflow_1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 38892813 entries, 389573 to 6824
Data columns (total 6 columns):
 #   Column             Dtype
---  ------             -----
 0   CMTE_ID            object
 1   TRANSACTION_AMT_4  float64
 2   TRANSACTION_AMT_1  object
 3   TRANSACTION_AMT_3  float64
 4   OTHER_ID           object
 5   CAND_ID            object
dtypes: float64(2), object(4)
memory usage: 2.0+ GB

In [ ]:
inflow_1["TRANSACTION_AMT_1"]=pd.to_numeric(inflow_1["TRANSACTION_AMT_1"],errors="coerce")#Converting object datatype to numeric for further calculation

In [ ]:
inflow_1["CASH_INFLOW"]=inflow_1["TRANSACTION_AMT_1"].fillna(0)+inflow_1["TRANSACTION_AMT_3"].fillna(0)# replacing null values with 0

In [ ]:
output=pd.DataFrame()

In [ ]:
flow=inflow_1.groupby("CAND_ID")
gb=flow.groups
output["CAND_ID"]=gb.keys()
output["Cash_Inflow"]=flow.sum()["CASH_INFLOW"].values
output["Cash_Outflow"]=flow.sum()["TRANSACTION_AMT_4"].values

In [ ]:
output["Balance"]=output["Cash_Inflow"].fillna(0)-output["Cash_Outflow"].fillna(0)

In [ ]:
output

        CAND_ID  Cash_Inflow  Cash_Outflow  Balance
0     C00713602          0.0           0.0      0.0
1     H0AK00105          0.0           0.0      0.0
2     H0AL01055          0.0           0.0      0.0
3     H0AL01063          0.0           0.0      0.0
4     H0AL01071          0.0           0.0      0.0
...         ...          ...           ...      ...
6133  S8WV00119          0.0           0.0      0.0
6134  S8WV00127          0.0           0.0      0.0
6135  S8WV00143          0.0           0.0      0.0
6136  S8WY00189          0.0           0.0      0.0
6137  S8WY00197          0.0           0.0      0.0

[6138 rows x 4 columns]

In [ ]:
inflow_1

           CAND_ID    CMTE_ID  ...  TRANSACTION_AMT_4  CASH_INFLOW
0        C00713602  C00712851  ...                NaN          0.0
1        H0AK00105  C00607515  ...                NaN          0.0
2        H0AL01055  C00697789  ...                NaN          0.0
3        H0AL01063  C00701557  ...                NaN          0.0
4        H0AL01071  C00701409  ...                NaN          0.0
...            ...        ...  ...                ...          ...
1719824        NaN  C00325936  ...              25.00          0.0
1719825        NaN  C00325936  ...              64.90          0.0
1719826        NaN  C00325936  ...              66.44          0.0
1719827        NaN  C00084954  ...             264.10          0.0
1719828        NaN  C00084954  ...             238.17          0.0

[38892813 rows x 7 columns]